Revit 2027 API
RebarReinforcementData.End Property
 The end of the rebar. The end should be 0 or 1.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int End { get; set; }
Public Property End As Integer
	Get
	Set
public:
property int End {
	int get ();
	void set (int value);
}
member End : int with get, set
Property Value
Int32
See Also
Reference
RebarReinforcementData Class
Autodesk.Revit.DB.Structure Namespace